<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"tts-10x-atj-staging","backend":"125e87403db316b345911b28e68a2cc3e500e7f8a9b402d36b8316b1ba5a19f6","plan_job_ref":"Job Post Terraform plan to PR comment #387 at https://github.com/GSA-TTS/forms/actions/runs/11710008451","plan_out_hash":"c3e40b80d16c9416c57767027f8e2432fa488691f2d75449d45346847147d671","plan_hash":"72cf47e70a0a2eac371030d825ce9ff431f4c62cab15156a99ce12d9d786f4a5","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __tts-10x-atj-staging__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudfoundry_app.tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-app_E0D2137F will be created
+   resource "cloudfoundry_app" "tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-app_E0D2137F" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/atj-platform/server-doj:de4bde57fad7047af0f81a712f1fee059e510ec6"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-atj-staging-server-doj-app"
+       ports                           = (known after apply)
+       space                           = "132fc49b-e29e-40b3-8914-4233e4d4caf4"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = "5f2eddbb-1011-4cd8-89bf-a01048830b8b"
        }

+       service_binding {
+           service_instance = "3d5c5443-ae33-4bc6-a23b-2095fcba2fbe"
        }
+       service_binding {
+           service_instance = "f4d7b511-20cf-47d4-bf25-3bc2a848e8f4"
        }
    }

  # cloudfoundry_app.tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-app_0CAEC23C will be created
+   resource "cloudfoundry_app" "tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-app_0CAEC23C" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/atj-platform/server-kansas:de4bde57fad7047af0f81a712f1fee059e510ec6"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-atj-staging-server-kansas-app"
+       ports                           = (known after apply)
+       space                           = "132fc49b-e29e-40b3-8914-4233e4d4caf4"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = "d99c99cf-ecb3-4885-a5b2-8b95fc3bd1bd"
        }

+       service_binding {
+           service_instance = "b6df5c68-b06e-498c-a4ad-5a4a84d77fb1"
        }
+       service_binding {
+           service_instance = "097d925c-7aa5-489b-82df-d50abe38e284"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Post Terraform plan to PR comment #387](https://github.com/GSA-TTS/forms/actions/runs/11710008451)